In [1]:
import pandas as pd

In [2]:
adf = pd.DataFrame({"x1": ["A", "B", "C"], "x2": [1, 2, 3]})
adf

  x1  x2
0  A   1
1  B   2
2  C   3

In [3]:
bdf = pd.DataFrame({"x1": ["A", "B", "D"], "x3": ["T", "F", "T"]})
bdf

  x1 x3
0  A  T
1  B  F
2  D  T

In [4]:
# 첫 번째 인자가 left
# 두 번째 인자가 right
# 세 번재 인자는 기준으로 하는 방법
# 네 번째 인자는 기준 column (key)
pd.merge(adf, bdf, how='left', on='x1')

  x1  x2   x3
0  A   1    T
1  B   2    F
2  C   3  NaN

In [5]:
pd.merge(adf, bdf, how='right', on='x1')

  x1   x2 x3
0  A  1.0  T
1  B  2.0  F
2  D  NaN  T

In [6]:
# inner은 둘 다 해당하는 값
pd.merge(adf, bdf, how='inner', on='x1')

  x1  x2 x3
0  A   1  T
1  B   2  F

In [7]:
# outer은 모두 -> 없는 값은 NaN
pd.merge(adf, bdf, how='outer', on='x1')

  x1   x2   x3
0  A  1.0    T
1  B  2.0    F
2  C  3.0  NaN
3  D  NaN    T

In [16]:
bdf.x1

0    A
1    B
2    D
Name: x1, dtype: object

In [8]:
# 안에 내용이 밖에 내용에 존재하면 True, 아니면 False
adf.x1.isin(bdf.x1)

0     True
1     True
2    False
Name: x1, dtype: bool

In [9]:
# 다시 재정의
adf[adf.x1.isin(bdf.x1)]

  x1  x2
0  A   1
1  B   2

In [10]:
# 안에 내용이 밖에 내용에 존재하지 않으면 저장
adf[~adf.x1.isin(bdf.x1)]

  x1  x2
2  C   3

In [11]:
ydf = pd.DataFrame({"x1": ["A", "B", "C"], "x2": [1, 2, 3]})
ydf

  x1  x2
0  A   1
1  B   2
2  C   3

In [12]:
zdf = pd.DataFrame({"x1": ["B", "C", "D"], "x2": [2, 3, 4]})
zdf

  x1  x2
0  B   2
1  C   3
2  D   4

In [13]:
# 기본 값은 inner join
pd.merge(ydf, zdf)

  x1  x2
0  B   2
1  C   3

In [14]:
# otpion을 outer join 으로
pd.merge(ydf, zdf, how='outer')

  x1  x2
0  A   1
1  B   2
2  C   3
3  D   4

In [17]:
# indicator : 어떻게 merge를 했는지 확인 가능
# qeuery : 어떻게 merge를 하는지 설정
pd.merge(ydf, zdf, how='outer', indicator=True
        ).query('_merge == "left_only"'
               ).drop(columns=['_merge'])

  x1  x2
0  A   1